In [10]:
#2021.06.01. TUE
#Hankyeong

##CH04-4. 데이터프레임의 데이터 조작
#00. 패키지 호출
import numpy as np 
import pandas as pd 
import seaborn as sns 

#01. count() 메서드로 데이터(혹은 row) 갯수 세기.
s = pd.Series(np.random.random(9))
s

0    0.895479
1    0.241322
2    0.334106
3    0.570733
4    0.500490
5    0.311152
6    0.591713
7    0.709969
8    0.527536
dtype: float64

In [2]:
s.count()

9

In [3]:
#PLUS, NAN값 처리하고 데이터 갯수 세기. 
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  4.0  1.0  0.0  4.0
1  3.0  0.0  4.0  1.0
2  1.0  1.0  4.0  NaN
3  2.0  0.0  3.0  1.0

In [9]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [38]:
#PLUS, titanic 데이터셋의 데이터 개수 확인하기. 
titanic = sns.load_dataset("titanic")
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [ ]:
#MEMO. age, embarked, deck 열에 결측값이 존재함을 확인할 수 있음.

In [7]:
#02. value_counts()로 데이터셋의 특정 컬럼(혹은 변수)의 데이터 값의 빈도 확인하기.
#(1) survived 열의 빈도 확인하기.  
titanic["survived"].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [20]:
#(2) sex 열의 빈도 확인하기. 
titanic["sex"].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [13]:
#03. 데이터셋 정렬하기. 
#(1) sort_values() 메서드를 이용해 데이터 값을 기준으로 정렬하기. 
#①1번째 열로 오름차순 정렬하기. 
df[0].sort_values()

2    1.0
3    2.0
1    3.0
0    4.0
Name: 0, dtype: float64

In [12]:
#②1번째 열로 내림차순 정렬하기. 
df[0].sort_values(ascending=False)

0    4.0
1    3.0
3    2.0
2    1.0
Name: 0, dtype: float64

In [4]:
#③1번째 열의 값을 기준으로 오름차순 처리하기. 
df.sort_values(by=0)

     0    1    2    3
2  1.0  1.0  4.0  NaN
3  2.0  0.0  3.0  1.0
1  3.0  0.0  4.0  1.0
0  4.0  1.0  0.0  4.0

In [7]:
#(2) sort_index() 메서드 사용해 데이터 인덱스를 기준으로 정렬하기.  
#①titanic 데이터셋의 embarked열을 데이터 빈도를 확인하기. 
titanic["embarked"].value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [17]:
#②embarked열의 데이터 빈도값의 인덱스를 기준으로 정렬하기.
titanic["embarked"].value_counts().sort_index()

C    168
Q     77
S    644
Name: embarked, dtype: int64

In [19]:
#04. 데이터프레임의 행/열 합계구하기. 
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  4  5  9  0  6  5  8  6
1  6  6  6  1  5  7  1  1
2  5  2  0  3  1  0  2  6
3  4  8  5  1  6  7  5  6

In [20]:
#(1) 행 기준으로 합계 구하기. 
df2.sum(axis=1)

0    43
1    33
2    19
3    42
dtype: int64

In [14]:
#(2) 열 기준으로 합계 구하기.
df2.sum(axis=0)

0           19
1           21
2           20
3            5
4           18
5           19
6           16
7           19
row_sum    137
dtype: int64

In [21]:
#PLUS. row_sum, col_sum 변수 만들기.
df2["row_sum"] = df2.sum(axis=1)
df2.loc["col_sum",:]=df2.sum(axis=0)
df2

            0     1     2    3     4     5     6     7  row_sum
0         4.0   5.0   9.0  0.0   6.0   5.0   8.0   6.0     43.0
1         6.0   6.0   6.0  1.0   5.0   7.0   1.0   1.0     33.0
2         5.0   2.0   0.0  3.0   1.0   0.0   2.0   6.0     19.0
3         4.0   8.0   5.0  1.0   6.0   7.0   5.0   6.0     42.0
col_sum  19.0  21.0  20.0  5.0  18.0  19.0  16.0  19.0    137.0

In [ ]:
#TIP. sum()  외에도 mean(), max(), var(), std() 등의 계산 메서드가 존재함.

In [24]:
#05. apply()를 사용하여 복잡한 계산 처리하기. 
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [25]:
#(1) 열기준으로 최대값-최소값 빼기. 
df3.apply(lambda x: x.max() - x.mean())

A    1.0
B    0.8
C    1.8
dtype: float64

In [69]:
#(2) 행기준으로 최대값-최소값 빼기. 
df3.apply(lambda x: x.max() - x.mean(),axis=1)

0    0.666667
1    1.333333
2    1.666667
3    1.000000
4    0.333333
dtype: float64

In [39]:
#PLUS. 이를 응용하여 쉽게 범주화할 수 있음. 
titanic["adult/child"] = titanic.apply(lambda r: 'adult' if r.age >= 20 else "child", 
                                       axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [46]:
#06. fillna() 메서드를 사용해 결측값 대체하기. 
#(1)
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [47]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [56]:
#(2) titanic 데이터셋의 age 변수의 결측값 처리하기. 
age_mean = int(titanic["age"].mean())
titanic["age"] = titanic["age"].fillna(age_mean)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [57]:
#07. astype() 메서드로 데이터타입을 변환하기. 
df3.astype(int)

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [58]:
#08. cut() 메서드를 통해 특정 범위를 지정하여 범주화하기.
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [60]:
#09. qcut() 메서드를 통해 비율로 범주화하기. 
data = np.random.randn(1000)
cats = pd.qcut(data, 3, labels=["Q1", "Q2", "Q3"])
cats

['Q2', 'Q2', 'Q3', 'Q1', 'Q1', ..., 'Q1', 'Q1', 'Q1', 'Q2', 'Q1']
Length: 1000
Categories (3, object): ['Q1' < 'Q2' < 'Q3']

In [61]:
pd.value_counts(cats)

Q1    334
Q2    333
Q3    333
dtype: int64